/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   lem_in.h                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: val <val@student.42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/07/09 05:23:43 by val               #+#    #+#             */
/*   Updated: 2020/07/23 21:41:47 by val              ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#ifndef LEM_IN_H
# define LEM_IN_H

# include <stdlib.h>
# include <unistd.h>
# include "libft.h"
# include "ft_list.h"

int	ft_error(t_storage *st);

#endif

/*
Уязвимости
Ссылки на комнат на самих себя
Старт не соединён с финишем
Несколько стартов или финишей
*/